[{"text": "Used to love lido it was always nice food and it's gone downhill last few years, fried potatoes were very tasty tho", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "Should you be looking for inexpensive local meal in Tallinn Lido is your choice. Good food of cusine typical for Baltic states is offered there at reasonable prices", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "Visited a Lido in Riga, so was happy to visit here too. Wide range of choices for meat eaters, but limited for vegetarians, though there are a few dishes available. Very cheap- 6€ for cauliflower cheese and tomato dish, with chips and cucumber salad.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "Visited here with family twice during our stay in Tallinn. Typical, good food. Unfortunately the variety of food available was not very wide when we visited in the evening. Inexpensive restaurant, very popular with locals", "food": 1, "service": 0, "ambiance": 1, "price": 0, "location": 0}, {"text": "Premium buffet and better price, next to the old town, and where the decoration and quality give you a perfect meal", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "LIDO in the Solaris Center became my regular place for lunch & dinner during my 5 days stay in Tallinn this Summer.The food was always tasty, the portions fine and the prices quite friendly.My favorite was a \"curd pancake\" for dessert ;-)", "food": 1, "service": 1, "ambiance": 1, "price": 1, "location": 0}, {"text": "I'm not going there again. The sammon I took, was too salty and there were sooo much fish-grease (fat) I could't eat it. Fish-grease tastes so bad. Always should take it carefully away when cook sammon. Also other food we tasted were no special. No smiles at stuffs face. Nobody really speak english. Not our place really.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "A self-service place in a shopping mall that offers everything for everybody - tasty and quite cheap food just a few minutes from the city center.", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 0}, {"text": "This is self service eatery, not restaurant. If you select wisely it is cheap but if you take good ones it is expensive. Better to go elsewhere if you want to have decent food with service.", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 0}, {"text": "This place is a place that everything for everybody. You can choose your meal and pay what you take.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "This restaurant is located in a shopping mall and has self service. You may pick your food from different service stations (like a buffet style). Food is tasty. The prices are ok but not cheap. The atmosphere is rather as if you were in a fast food restaurant but absolutely ok.", "food": 1, "service": 0, "ambiance": 1, "price": 1, "location": 0}, {"text": "We've been here few times. The food is home made style. The prices are reasonable. Sometimes it's hard to find tables to seat but it's a good thing I suppose. We did get bored eating the same things everytime but the restaurant isn't crossed off our list. Go try it for yourself.", "food": 1, "service": 0, "ambiance": 1, "price": 1, "location": 0}, {"text": "Something for every taste & good prices. Take some time to check out all different options .. otherwise you may overorder easily.", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "A self service restaurant with a variety of choices of satisfactory quality. Τhe prices are low. I went 3 times and i suggest it to someone who want to eat cheap and good.", "food": 1, "service": 1, "ambiance": 0, "price": 1, "location": 0}, {"text": "Very bad dinner We take french fries and chicken Chiken  no cocked French frirs was ok Over priced place", "food": 1, "service": 0, "ambiance": 1, "price": 1, "location": 0}, {"text": "It is hard to find a cheap restaurant in the old town. If you are in a budget and don't mind walking 10 mins you will not be disappointed. Wide range, good quality, big portions and cheap price. If you are not in Tallinn for a cuisine experience, this is definetely a must-go place.", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 1}, {"text": "The different kinds of food on offer is just amazing, various soups, starters, hot dishes and deserts, plenty of alcohol including Kwass, all at reasonable prices. Contrary to other reviews, the food is very special.", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "This is very similar to a hotel restaurant buffet but there is certainly a good range of hot and cold foods, deserts, plenty of alcoholic and non-alcoholic drinks and all in a very clean environment with masses of seating. It may lack any Estonian atmosphere but it is certainly good value for money.", "food": 1, "service": 0, "ambiance": 1, "price": 1, "location": 0}, {"text": "It was my third visit, it's good to have home comfort food. But cashier's are not paying attention, they chat between each other, bad sales practice I would say.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "From outside, this place seems to be very expensive, but at the end, it results to be a very affordable restaurant. For 8 euros I had a complete meal, including a small salad and a crazy drink that tastes like cheese (It seemed to be a refreshing herb drink, hahaha).", "food": 1, "service": 0, "ambiance": 1, "price": 1, "location": 0}, {"text": "Big choice of delicious food. Lots of healthy snacks.Fried potatoes taste like a home made from mum.Only disappointed with service as you need to clean table for yourself after other people.( not always)", "food": 1, "service": 1, "ambiance": 1, "price": 0, "location": 0}, {"text": "I go to Lido while visiting Tallinn because there is a variety of food and I don’t have to wait to get it, and it’s relatively cheap (except salads). But the customer service is like in a museum of Soviet Union! Not efficient, not friendly, not polite, no good manners, it is just dull and quite slow. It feels like these women don’t enjoy at all working there (I haven’t seen any man). ", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 0}, {"text": "There is a wide variety of dishes to choose from, the prices are good (you can really fill up for 10 euros)! After visiting this Lido, we continued frequenting the same chain in other Estonian and Latvian cities :)", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "After a tiring day at the art gallery we wanted to eat quickly and well. Found Lido on the 3rd floor of the Solaris centre. Excellent home style food, massive choice and quick. Also excellent value. Seemed to be very popular with local people.", "food": 1, "service": 1, "ambiance": 0, "price": 1, "location": 0}, {"text": "The food is soo good with a good variety snd very affordable, I definitely it and I will visit it again when I will go to Tallin.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "A nice buffet. No gourmet food, russion style. Had fish and rice and a soup. With salad and beer under 15€ a person and we enjoied the meal.", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 0}, {"text": "Well.... why we are going anywhere else,if Lido is close to our apartment..nice ambiance & huge place to sitting.Varieties are countless..Foods are fresh & juicy.Price is pocket friendly..", "food": 1, "service": 1, "ambiance": 1, "price": 1, "location": 0}, {"text": "The best thing about this buffet place is there will always be something in offer that would please everyone. It's located right in the 2nd floor of the shopping mall Solaris. Good variety on offer. The prices are pocket friendly. Very attentive staff to clean up the tables. What more would one want.", "food": 1, "service": 1, "ambiance": 1, "price": 1, "location": 0}, {"text": "‘Choose whatever you want’ canteen style restaurant on the first floor of a mall. Friendly staff, lots of choice. Steak, potatoes, cake and a drink for Ten Euros. Take my money now!", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 0}, {"text": "cheap , ready , delicious food. you can have there breakfast, lunch and dinner as well. recomended this place :)", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "It's one of my favourite places for a quick and cheap bite! The trick is the food is PRETTY GOOD there! very good! Nice home cooked dishes that make you warm and fed :) I really like all the pancakes, chicken cutlets, rice and potatoes. everything is well cooked and healthy.", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 1}, {"text": "We like this place really much because of cheap and fresh food, huge selection of desserts and salads. If you're hungry this is a wonderful place, plates are really big. And taste like home made, comfortable atmosphere.", "food": 1, "service": 0, "ambiance": 1, "price": 0, "location": 0}, {"text": "Travelling with kids it can be really hard sometimes to find a place to eat that will keep everyone happy. This cafeteria easily catered for all of us. Obviously the food is not a'la carte, but it is quite acceptable, reasonably priced and there is a good selection to choose from. ", "food": 1, "service": 0, "ambiance": 1, "price": 1, "location": 0}, {"text": "We eat here at Christmas evening. The food where good, but not excellent. I had to use salt both in my salads and in my main course so the taste tasted stronger and better. The service is good.", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 0}, {"text": "the food is homely and nice. selection is very wide. i just wish the dessert section could be a bit wider.  overall i like the place . it is convenient especially after a movie or concert.", "food": 1, "service": 0, "ambiance": 1, "price": 0, "location": 0}, {"text": "Always enough places, always all dishes/drinks are available. The quality is good, meat is hot, drinks are cold enough. Some interesting drinks, like water with lime and peppermint or cold sweet tea, also with peppermint. It is necessary to take some marinated onion! Very acceptable prices.Tip for locals : your ID - card will always give some discount. ", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "We were surprised when we finally found this cosy place. There is a great choice of food from starters to desserts, as well as many drinks to try. It's possible to have a relatively big lunch/dinner for about 6€.", "food": 1, "service": 0, "ambiance": 1, "price": 0, "location": 0}, {"text": "This cafeteria style restaurant was a nice change while traveling and eating in restaurants everyday. It was inexpensive and pretty decent food. It’s always nice to find a different style restaurant while on the go that has good food.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "Great value for money and plenty of choice. Soup, starter, mains with veg and potato, lovely desert and a large beer, 16 euros!", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "We have visited this particular restaurant several times in the last 3 years, and each and every time we haven't been disappointed. Don't expect fancy food: you will find hearty, filling meals at a cheap price. For around €20 a couple eats until more than full. It can get crowded during weekends' lunches or dinners, but it is the place to go for a quick, inexpensive but tasty meal. Recommended.", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "Good value for money, some tasty dishes some average dishes, you get what you pay for, canteen food. Good if you are on a budget and located in the Solarium centre so very accessible.", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "This is a self service restaurant, you pick what you want from the kitchen and pay at the register. The food was very good and i had a good time.", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 0}, {"text": "Lido restaurant located on 1st floor upstairs in Solaris shopping mall offers a wide variety of dishes and very good value in a swiss buffet style restaurant.", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "great value for money. tasty food. lots of choice. beer on draught also.  big portion sizes also.  can't fault it", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "We were only in Tallinn for the day but chanced upon this restaurant in the shopping centre - a lucky find.  The food was plentiful and there was a huge choice (including vegetarian options).  We would highly recommend visiting.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "Stop during cruise, found this place and was pleasantly surprised.  Friendly service and good food.Try to local fare, just enjoy.", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 0}, {"text": "it's inside Solaris mall actually, most waitress there they don't speak English but the system is quiet easy to understand, take a plate and keep looking for the wide varieties and tasty food, all items there are prices on it so it's quiet easy to calculate how much you are going to pay.tasty, convenient, fast and well priced !", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "Ate there twice as the food was delicious, traditional, and cheap. A very lovely atmosphere and a nice alternative to guessing what the food will be like based off the menu: here you see the food yourself.", "food": 1, "service": 0, "ambiance": 1, "price": 0, "location": 0}, {"text": "Food was ok, but it was too pricey for what you get at the end.Breakfast choice was not that big, sausages and pancakes.As we did not have enough time to search around in the morning, this was a quick save :)", "food": 1, "service": 0, "ambiance": 1, "price": 0, "location": 0}, {"text": "Food was typical to other lidos in flavour. It was good. My soup one day there was cool and was supposed to be hot. I ordered the same thing two days in a row and the prices were rang up differently both days?? Good selection on basically whatever you feel like eating!! ", "food": 1, "service": 0, "ambiance": 1, "price": 1, "location": 0}, {"text": "This lidos is the most expensive one we ate at. That being said it's still cheaper than the alternative. For a healthy and hearty meal go to lidos!", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "We visited Lido in both Tallinn and Riga. A cafeteria style restaurant which is very good value. Plenty of choice and delicious food", "food": 1, "service": 0, "ambiance": 0, "price": 1, "location": 0}, {"text": "Lido is not a restaurant but an eatery. There is not service but self service. It seems cheap but for the money you can it in real restaurant. Quality is also not best.", "food": 1, "service": 1, "ambiance": 0, "price": 1, "location": 0}, {"text": "Went to Lido on 7 July for dinner at 7:00 pm because Lido in Riga was good. Here the food was very oily and heavy. I would not recommend nor would I go back.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "Lots of different kinds of dishes. Easy with children as they see the food before choosing. Some dishes might be a little stale. Restaurant has lots of seats but was still crowded when we visited.", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 0}, {"text": "Good food, both selection and taste. Went there with kids, a good choice as the variety was great. All was of good quality, and unit proces were pretty cheap.... the total ended up quite big as we were hungry:) p.S. The stuffed pancakes are great, and really cheap too!!", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "You'll find it in a shopping mall first floor. It's like a cantine that you go around and choose your meal. The sitting area is very nice with a high window front. We paid for to meals and drink only 14€ and it was delicious.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "Lido is a canteen in a shopping mall first floor. You can assemble your meal how you like. It is tastefull, cheap and you can sit comfortable. We paid for 2 Main Courses with cider 14€. On the top of the shopping mall is a roof top bar. ", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "The restaurant offers a wide scale of foods for average price. The restaurant is clean. But The selling food has no taste.", "food": 1, "service": 0, "ambiance": 1, "price": 1, "location": 0}, {"text": "This cafeteria-style place is located a short walk from the old town.We found Tallinn to be quite an expensive city, so we were happy to find this place. On our visit, we chose two mains and two starters for a grand total of 15€. We thought the food was good quality and very tasty.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "There are done good foods but actually it is very expensive. They gave 2.9 euros some olives. It is very tricky I think. Give a chance another restaurant.", "food": 1, "service": 0, "ambiance": 0, "price": 0, "location": 0}, {"text": "very tasty food & cheap when compared to the restaurants in the city centre. Run probably by Russians, who do not speak that well English, but that was not really an issue since you are able to pick the food by yourself. I enjoyed the sweets & self-service beer tap :-)", "food": 1, "service": 1, "ambiance": 0, "price": 0, "location": 0}]